<div class="warning-popup" style="display: none;">
    Рады приветствовать вас в нашей  симуляции!
    Вы
    Алексей Федоров, начальник отдела анализа и планирования.

    Сегодня
    Четверг, 4 октября 2013 года, завтра в 20.00 вы уезжаете в отпуск на две недели.
    Вам предстоит прожить один рабочий день.
    До отпуска у вас есть масса дел, важно понять и сделать сегодня самые приоритетные.

    Внимательно
    Посмотрите вводное видео. Вы получите важную информацию о ваших коллегах, ситуации на работе, начале рабочего дня.

    Ваша цель в игре
    Определить и выполнить приоритетные задачи, затратив минимально необходимое количество времени!
    <a href="#" data-href="#" class="start-full-simulation-next start-full-simulation-now">Далее</a>
</div>