<?php
    $this->pageTitle = 'Skiliks - Игры с соискателем: как успешно пройти собеседование';
    //$this->pageDescriptions = '';
    //$this->pageKeywords = '';
?>

<!--product-->
<section class="pull-content-center">
    <br/>
    <h1 class="pull-content-center">
        Игры с соискателем: как успешно пройти собеседование
    </h1>

    <span class="pull-content-center">

        <br/>
        <br/>

        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/e-xecutive-1-3.jpg">
        <br/>
        <br/>

        <p>
            Вполне возможно, что ваш новый потенциальный работодатель вместо собеседования предложит для начала пройти уровни в онлайн-игре. О том, зачем это нужно компаниям и станут ли игры стандартным элементом отбора в будущем, читайте в статье на E-xecutive.ru
            <br/>
            <br/>
            Рекрутеров довольно часто обвиняют в том, что их методы оценки кандидатов субъективны и приводят к ошибкам, которые впоследствии дорого обходятся бизнесу. Определить, насколько хорошо будет работать тот, кто сумел показать себя с лучшей стороны в ходе интервью, действительно очень сложно. Поэтому находятся энтузиасты, которые пытаются с помощью новых технологий усовершенствовать процесс найма и снизить вероятность попадания неподходящих людей на открытые позиции.
        </p>

        <h2>
            Поведенческие профили кандидатов
        </h2>

        <p>
            Разнообразные тесты и опросники в процессе отбора используются уже очень давно, однако их эффективность с точки зрения предсказания поведения соискателей довольно спорна. Сегодня они трансформируются в более сложные системы, позволяющие формировать поведенческие профили.
            Например, Evolv использует особые опросники для оценки кандидатов на почасовые виды работ в Xerox и Harte-Hanks.Соискатели отвечают на множество разнообразных и часто неожиданных вопросов. Например, насколько далеко они живут от предполагаемого нового места работы и какими социальными сетями пользуются. С 2007 года Evolv собрала и проанализировала терабайты данных, которые содержат не только ответы соискателей, но и их реальные истории трудоустройства – как долго они в итоге оставались на каждом месте работы, насколько были результативны, насколько клиенты были ими довольны. С помощью программного обеспечения компания моделирует возможное будущее поведение и результативность каждого потенциального работника, выделяя наиболее перспективных.
            <br/><br/>
            Собранная статистика относительно поведенческих профилей кандидатов противоречит многим распространенным стереотипам рекрутеров. Например, было установлено, что частая смена работы и большой перерыв между работодателями не позволяют предсказать, как долго человек задержится на новом месте. «Мы как человеческие существа не очень-то хорошо умеем оценивать других человеческих существ», - отмечает вице-президент Evolv Дэвид Остберг.
            <br/><br/>
            Насколько эффективен подобный подход? Согласно данным Evolv, работники, которые были отобраны с помощью их системы для работы в call-центре Harte-Hanks, на 29% реже прогуливали работу в течение первых шести месяцев и на 15% быстрее обрабатывали звонки по сравнению с теми, кто был нанят до того, как компания начала использовать их программное обеспечение.
        </p>

        <br/>
        <br/>

        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/e-xecutive-1-2.jpg">

        <br/>
        <br/>

        <h2>
            Как в ходе игры оценивают соискателей
        </h2>

        <p>
            Такие компании как IBM, Marriott Hotels и американские вооруженные силы и раньше экспериментировали с играми для потенциальных сотрудников, так что идею оценки кандидатов в игровой форме тоже нельзя назвать принципиально новой. Однако современные технологии позволили существенно развить и обогатить это направление.
            <br/><br/>
            Калифорнийский стартап Knack помогает компаниям сканировать кандидатов, выявляя их личные качества с помощью игры Wasabi Waiter, которая выглядит так же, как и сотни других несложных онлайн-игр. Кандидат играет роль официанта, который должен обслужить посетителей в переполненном ресторане. Он следит за настроением только что прибывших и сидящих за столиками клиентов, приносит им различные блюда, заботится о том, чтобы все были довольны. Но, в отличие от обычных игр, Wasabi Waiter ежесекундно анализирует поведение играющего, измеряя добросовестность, способность распознавать эмоции, а также другие качества, которые связаны с результативностью в работе. За 15 минут игры программа анализирует сотни параметров, определяя как интеллектуальный уровень, так и личностные особенности кандидата. В итоге Knack производит расчет и выдает кандидату оценку, насколько велики его шансы стать хорошим сотрудником.
            <br/><br/>
            Knack – далеко не единственная компания, которая пытается адаптировать технологии big data, чтобы усовершенствовать процесс отбора кандидатов. И подобные сервисы востребованы работодателями, потому что помогают им справиться с большим объемом поступающих резюме и быстро отсеять неподходящих кандидатов. «Люди – наш самый большой ресурс, и прямо сейчас многие из них находятся не на своем месте», - говорит Эрик Бринйолфссон, советник Knack и директор Центра цифрового бизнеса в Sloan School of Management.
            <br/><br/>
            Нью-йоркский стартап ConnectCubed использует для оценки кандидатов сложную комбинацию из опросников и игр и утверждает, что способен с их помощью оценить кандидатов практически на любую позицию. Сначала ConnectCubed тестирует сотрудников компании, которые на протяжении долгого времени демонстрируют высокую результативность, чтобы создать «идеальный» поведенческий профиль для каждой конкретной организации. А затем сравнивает профили кандидатов с «идеальным» профилем, выявляя тех, кто наилучшим образом соответствует культуре компании и требованиям конкретной позиции.
            <br/><br/>
            оссийский проект Skiliks, запущенный в сентябре 2013 года, представляет собой игру-симулятор, с помощью которой можно оценить базовые менеджерские навыки играющего. Игрок погружается в ситуации, максимально приближенные к реальности, и начинает действовать так же, как обычно действует в жизни. «В настоящий момент у нас зарегистрировано около 600 корпоративных пользователей, а всего игру прошло более 2 тыс. человек, - рассказывает Антон Пряничников, соучредитель Skiliks. - Игра рассчитана в большей степени на менеджеров среднего звена. Когда мы запустили проект, мы изначально позиционировали его как инструмент для оценки внешних кандидатов. Однако в процессе работы выяснилось, что наши клиенты чаще используют симулятор для оценки уже работающих сотрудников. Впоследствии мы добавили опции, связанные с развитием оцениваемых навыков. Так мы добавили детальную расшифровку получаемой оценки и индивидуальный план развития сотрудника. Также теперь можно сравнить данные своей компании со средним показателем других организаций. Все эти инструменты позволяют оценить текущий уровень управленческого потенциала в компании и сформировать план обучения».
        </p>
        <h2>
            Как с помощью игры привлекают кандидатов
        </h2>
        <p>
            Некоторые компании используют игры не для того, чтобы оценить кандидатов, а чтобы просто найти тех, кто близок им по духу. Например, WibiData специально наняла разработчика, чтобы тот написал дополнительные уровни для популярной игры Portal 2 и воссоздал в них виртуальный офис компании. По словам генерального директора WibiData Кристофа Бишилья, ему просто хотелось выделиться на фоне других работодателей, показать кандидатам, что здесь они найдут незаурядных и веселых людей. И он решил сделать процесс подачи резюме столь же увлекательным, как и сама работа в компании.
            <br/><br/>
            Почему Бишилья выбрал путь создания новых уровней в игре Portal 2? «Половина команды WibiData играет в эту игру, наш офис любит подобные игры, прямо сейчас мы разрабатываем две похожие», - отвечает он. Как раз тогда, когда он принял решение о создании новых уровней, ему на глаза попалась работа программиста Дуга Хугланда, который помог молодому человеку по имени Гэри Хадстон сделать предложение руки и сердца своей девушке через игру Portal 2.Его работа насколько понравилась Бишилья, что тот тут же нанял его.
            <br/><br/>
            В итоге Хугланд написал дополнительные уровни, где незадачливый директор Бишилья постоянно забывает свой пароль к карьерному сайту WibiData. Игроки должны по мере прохождения уровней собрать все цифры пароля и решить уравнение в конце игры, чтобы получить возможность отправить свое резюме. Спустя лишь неделю после того как новые уровни стали доступны для всех желающих поиграть, WibiData получили множество резюме от подходящих кандидатов. А также смогли привлечь внимание к своей компании. Карьерную страницу просмотрели более 30 тыс. раз, игру загрузили 1 тыс. пользователей, всего было получено 30 резюме. «По сравнению со стоимостью привлечения рекрутера к закрытию всего одной вакансии это, безусловно, лучшая инвестиция, которую я сделал в маркетинг и рекрутинг», - говорит Бишилья.
        </p>
        <h2>
            Плюсы и минусы
        </h2>
        <p>
            С помощью новых технологий в основном оценивают рядовой персонал, максимум - управленцев среднего уровня. Алена Владимирская, основатель рекрутингового агентства PRUFFI, считает, что получить полное впечатление о способностях кандидата с помощью игр и симуляторов невозможно, но из этого не следует, что они бесполезны: «С их помощью можно оценить отдельные навыки. Например, насколько хорошо человек умеет планировать задачи – для менеджера среднего уровня или менеджера проекта это очень важное качество. Или насколько человек стрессоустойчив и коммуникабелен». Однако пока, отмечает Владимирская, ей известны отрицательные примеры оценки с помощью игр, а не положительные.
            <br/><br/>
            По мнению Андрея Подшибякина, генерального директора InsightONE, использование традиционных способов оценки кандидатов чаще всего приводит к «эффекту фокус-групп». То есть соискатели в ходе прохождения тестов и опросов стараются выглядеть лучше, чем они есть на самом деле. Игровые механики заставляют людей раскрыться, не оставляя возможностей для притворства.
        </p>
        <h2>
            Какие компании используют игры
        </h2>
        <p>
            На первый взгляд может показаться, что игровые методы подбора и оценки сотрудников больше всего подходят компаниям, работающим в сфере высоких технологий. Но это не так. Нефтяной гигант Shell использует игры, чтобы выявить внутри компании инноваторов. Ганс Харинга, руководитель инновационного подразделения Game Changer, утверждает, что если раньше доля успешных попыток составляла 30%, то сейчас она выросла почти до 80%.
            <br/><br/>
            «Нефтяные, металлургические и другие крупные компании сейчас проявляют большой интерес к этим технологиям, - рассказывает Андрей Подшибякин. - У нас был опыт разработки игры-симуляции для корпоративного университета российской сырьевой компании, с помощью которой сейчас проводится аттестация младшего управленческого состава. В ходе игры, которая воспроизводит алгоритмы, использующиеся в реальной профессиональной деятельности компании, сотрудники должны правильно выстроить производственную цепочку, а результаты оценивает их преподаватель. Разработка игр для привлечения и оценки соискателей – также востребованное направление, у нас есть несколько брифов на подобные проекты. Крупные розничные и сырьевые компании со штатом свыше 5 тыс. человек сейчас очень внимательно смотрят на игровые технологии, их интересует предварительная оценка навыков кандидатов».
        </p>
        <h2>
            Прогноз на будущее
        </h2>
        <p>
            Наступит ли момент, когда игры на службе рекрутеров станут массовым явлением? «С одной стороны, мне бы очень хотелось, чтобы это произошло, - говорит Алена Владимирская, - но я сомневаюсь, что это возможно. Те игры и симуляторы, которые существуют на данный момент, в их нынешнем виде едва ли станут серьезным массовым инструментом. Пока они способны решать очень небольшие прикладные задачи. Но при этом я допускаю, что в будущем возможны прорывы. Инструменты поиска для рекрутеров постоянно улучшаются. Сначала появились первые базы, потом социальные сети, теперь игры и симуляторы. Это просто новые инструменты, которые позволяют делать работу быстрее, лучше, помогают снизить риски».
        <br/><br/>
            «Мне хотелось бы в это верить, но, к сожалению, игровые методики нельзя тиражировать, - считает Андрей Подшибякин. - То есть нельзя использовать одну и ту же HR-игру и в розничной компании, и на металлургическом предприятии. Дело в том, что каждая игра для каждой компании – это большая ручная работа. Ведь в ходе игры имитируются процессы, максимально приближенные к будущей деятельности кандидата. Если на рынке будет много профессиональных компаний, занимающихся разработкой подобных игр, то это направление получит широкое распространение. Но я, честно говоря, пока не вижу к этому предпосылок, так что в ближайшие годы это будет нишевая история».
        </p>
        <p>
            <strong>Мария Пикалова</strong>, специально для <a class="source" href="http://www.e-xecutive.ru/career/adviser/1921483/">E-xecutive.ru</a>
            <br/>
            При подготовке статьи использованы материалы сайтов <a class="source" href="http://www.businessweek.com/">Businessweek</a>, <a class="source" href="http://www.wired.com/">Wired</a>
            <br/>
            <br/>
            <a class="source" href="/static/articles">Все статьи</a>
        </p>
    </span>
</section>
<!--product end-->

<div class="clearfix"></div>