<?php
$this->pageTitle = 'Skiliks - При приеме на работу менеджеров заставляют играть в игры';
//$this->pageDescriptions = '';
//$this->pageKeywords = '';
?>

<!--product-->
<section class="pull-content-center">
    <br/>
    <h1 class="pull-content-center">
        Стартап skiliks поможет проверить вашего менеджера на профпригодность
    </h1>

    <span class="pull-content-center">

        <p>
            Кофаундер стартапа для оценки менеджеров skiliks Лея Левин рассказала нам о том, как можно проверить сотрудника при приеме на работу, что такое "serious games" и о том, что без корпоративного почтового клиента не может работать ни одна компания.
        </p>

        <br/>
        <br/>
        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/siliconrus-1-1.png">
        <br/>
        <br/>

        <h2>
            Пеганов: Леа, добрый день. Вы - кофаундер skiliks?
        </h2>

        <p>
            Левинa: Да. У нас ещё есть Антон Пряничников в кофаундерах и Мария Горина - СЕО.
        </p>

        <h2>
            Супер. Можете  рассказать - какой у вас бэкграунд, где ваша команда раньше работала?
        </h2>

        <p>
            Мария Горина, CEO. Топ-менеджер, предприниматель, стратегический консультант, одна из ведущих экспертов в России в области систем управления эффективностью.
            <br/><br/>
            Антон Пряничников. Менеджер онлайн проектов, эксперт по моделированию и алгоритмизации, стратегический консультант.
            <br/><br/>
            Лея Левина.  Стратегический консультант и практик по проведению изменений, менеджер по работе с ключевыми клиентами, эксперт в области оценки эффективности, мотивации, визуальных коммуникаций.
            <br/><br/>
            Мы с Машей раньше работали в Strategy partners. Маша с Антоном работали в Эксмо.
        </p>

        <h2>
            Невероятный трек-рекорд. И вы вот все вместе, после таких успешных проектов, решили сделать свой стартап skiliks. Как я понял, skiliks - B2B сервис для компаний где работает 100+ человек (когда уже СЕО не понимает чем занимается тот или иной менеджер), который проверяет профпригодность менеджеров. Верно?
        </h2>

        <p>
            Да, мы оставили свои сытые должности, чтобы сделать skiliks.
            <br/><br/>
            Сервис могут использовать все, у кого есть потребность проверять уровень менеджерских навыков, - руководители подразделений любого уровня, отделы HR, собственники бизнеса, рекрутинговые и HR агентства. Его могут использовать как для оценки навыков при приёме менеджера на работу, так и для оценки навыков сотрудников компании при регулярной аттестации, при составлении планов развития, при определении кадрового резерва размер компании не имеет значения, продукт доступен даже для малого бизнеса.
        </p>

        <h2>
            Ну я по себе сужу, если в компании 5 или там 10 человек, то примерно понятно, кто чем занимается. Думаю что человек до 30-50 все понятно, и необходимости в том, чтобы заставлять сотрудников играть в эти игры, нет.
            <br/><br/>
            Расскажите, а почему вы проверяете именно этих мифических "менеджеров"? У меня на визитке написано что я "менеджер младшего звена", т.е. тоже подхожу под критерий. Почему вы не тестируете копирайтеров, программистов, сейлзов?
        </h2>

        <p>
            Всегда есть потребность в привлечении новых людей, о которых пока не знаешь ничего. Поэтому для небольших компаний есть смысл использовать skiliks именно в процессе найма. Сотрудники тоже бывают проверены не со всех сторон, например, если они не попадали в ситуации, где могли бы проявить себя определённым образом, и руководитель может не знать, например, насколько хорошо человек умеет делегировать, если он его не наблюдал в соответствующих ситуациях. Мы сфокусировались на менеджерах – аудитории, в которой мы разбираемся очень хорошо.
            <br/><br/>
            Знаем проблемы, потребности, что определяет успешность менеджера и т.д. Плюс менеджеры - самая крупная и важная профессиональная группа. От эффективности менеджеров зависят ключевые аспекты бизнеса, цена ошибки при найме неквалифицированного менеджера очень высока. Менеджерские навыки - универсальны для всех отраслей.
            <br/><br/>
            Копирайтеры, программисты, сейлзы - узкие профессиональные группы, нет такого масштаба, как на менеджерах. Мы планируем добавлять модуль, связанный с продажами, чуть позже. То есть будет возможность тестировать и менеджеров, работающих в области продаж. Плюс, есть проблемы с квалификацией менеджеров, глобально и в России.
        </p>

        <br/>
        <br/>
        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/siliconrus-1-2.png">
        <br/>
        <br/>

        <h2>
            "Для небольших компаний есть смысл использовать skiliks именно в процессе найма".
            <br/><br/>
            Вы точно не путаете ничего? Для молодых компаний каждый кадр абсолютно критичен, и вы предлагаете положиться на заскриптованную игру при принятии решения о приеме сотрудника на работу?
        </h2>

        <p>
            Мы не говорим, что наша игра полностью закрывает вопрос найма. Она позволяет оценить управленческие навыки, мы не тестируем ни мотивацию, ни знания в предметных областях, ни соответствие человека компании.
        </p>

        <h2>
            Я немного играл в вашу симуляцию, там все построено на таких традиционных понятиях. Имейл-звонок-перезвонить-написать в аутлуке письмо и тд. Вы сознательно исключаете из своей целевой аудитории молодые компании, которые работают совсем по-другому? Которые про аутлук не слышали вообще.
        </h2>

        <p>
            Есть компании, где штат 50-70 человек, они на отдельные позиции прорабатывают десятки резюме Мы не исключаем молодые компании. У них есть какая-то почта, не обязательно аутлук, но и мы сделали эмуляцию некоего усреднённого почтового клиента.
        </p>

        <br/>
        <br/>
        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/siliconrus-1-3.png">
        <br/>
        <br/>

        <h2>
            Я к тому, что в условных стартапах имейлом пользуются постольку-поскольку. Все в скайпе/бейскемпе/асане, разве нет? У вас прямо такой, хардкорный менеджмент, как я его представляю в РЖД или в Почте России.
        </h2>

        <p>
            Ситуации, которые мы заложили в сценарий, встречаются наиболее часто во всех компаниях. По результатам тестирования мы получили отзывы, что рабочий день в игре очень схож с реальным, люди мгновенно забывают, что они играют и начинают "работать", и всегда демонстрируют свою типичную модель поведения.
            <br/><br/>
            Работу в скайпе, бейскемпе мы не тестируем.
            <br/><br/>
            Как только возникает взаимодействие со внешней средой (а у менеджеров оно возникает), то появляется и почтовый клиент, как только возникает большое количество разноплановых задач, то возникает и планировщик, и почта.
            <br/><br/>
            Демо-версия очень не показательна с точки зрения ощущения рабочего дня, она показывает лишь то, что наш тест - это не опросник с вариантами ответов, не проверка знаний, а игровая среда, в которой что-то происходит и можно что-то делать самостоятельно. Мы, конечно, заложили некую российскую специфику, чтобы сделать игру более эмоционально вовлекающей, но навыки управления, которые там оцениваются, одинаково используются во всех компаниях, как в инновационных, так и в совковых.
        </p>

        <h2>
            Эта штука стоит от $100 в месяц - можете поделиться первыми успехами? Компании довольны? Есть какие-то метрики/цифры эффективности?
        </h2>

        <p>
            100 долл в месяц - за 10 прохождений теста.
            <br/>
            1. Мы протестировали симуляцию на 140 менеджерах в 2 компаниях и получили 74% сравнительную валидность результатов, сравнивая результаты симуляции с оценкой непосредственного руководителя и руководителя руководителя, а также с текущими инструментами HR по оценке персонала.
            <br/>
            2. Компании (не только участвовавшие в тесте) видят широкий потенциал использования продукта - не только для найма, как мы изначально рассчитывали, но и для внутренней оценки менеджеров, с целью настройки системы обучения.
            <br/>
            3. 100% проходивших тест отмечают, что они были полностью погружены в виртуальную реальность и чувствовали себя как на работе. Для нас это очень важно, потому что задача serious games - именно в воссоздании условий, максимально приближенных к реальным, нам это позволяет тестировать именно реальные рабочие навыки.
            <br/><br/>
            Цитирую одного руководителя: Я ловил себя на том, что не играю, а работаю, и делаю те же самые ошибки, за которые себя ругаю в жизни.
            <br/><br/>
            Были и интересные находки, например, один менеджер, которого все считали не очень способным, вдруг показал высокие результаты. Стали анализировать ситуацию и выяснили, что его текущая низкая эффективность связана с низкой мотивацией, а не со способностями. Для его непосредственного руководителя это оказалось крайне ценной информацией, и он начал работать именно с его мотивацией.
            <br/><br/>
            Запустились мы пару недель назад и сейчас у нас около 2000 просмотров нашего рекламного ролика, 600 регистраций, из которых 50-60 корпоративных аккаунтов, полных симуляций пройдено около 50, и уже несколько платных клиентов. Мы даём 3 симуляции бесплатно в течение первого месяца использования, поэтому на платные тарифы сейчас переходят те клиенты, которым уже сейчас нужно больше симуляций.
        </p>

        <br/>
        <br/>
        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/siliconrus-1-4.png">
        <br/>
        <br/>

        <h2>
            Сравнительную валидность? Ясно. А у вас есть аналоги на Западе? Или это исконно российская разработка и идея?
        </h2>

        <p>
            Есть аналоги GameLearn, Serious Game - серьёзные игры для развития навыков. Мы пока делаем первый этап  - диагностика, как первый этап перед развитием навыков (наши дальнейшие планы - это разработка обучающих продуктов, игр по выработке навыков). По схеме работы в области оценки наиболее заметный конкурент - это SHL но они не делают квесты, интерактивные продукты, у них обычные онлайн тесты - опросники это разработка глобальная, просто пока реализуемая на российском рынке.
        </p>

        <h2>
            Кстати, видна серьезная подготовка и куча вложенных ресурсов. Расскажите - кто ваш инвестор - фонд/ангел?
        </h2>

        <p>
            Пока финансирование проекта обеспечиваем мы сами но мы рассматриваем возможности привлечения дополнительного финансирования для расширения масштаба
            <br/><br/>
            Спасибо, удачи!
        </p>

        <p>
            <strong>Саша Пеганов</strong>, специально для <a class="source" href="http://siliconrus.com/2013/10/skiliks/">siliconrus.com</a>
            <br/>
            <br/>
            <a class="source" href="/static/articles">Все статьи</a>
        </p>
    </span>
</section>
<!--product end-->

<div class="clearfix"></div>