<?php
$this->pageTitle = 'Skiliks - При приеме на работу менеджеров заставляют играть в игры';
//$this->pageDescriptions = '';
//$this->pageKeywords = '';
?>

<!--product-->
<section class="pull-content-center">
    <br/>
    <h1 class="pull-content-center">
        Skiliks: Как заставить менеджеров играть в серьёзные игры
    </h1>

    <span class="pull-content-center">

        <br/>
        <br/>
        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/the-village-1-1.jpg">
        <br/>
        <br/>

        <p>
            Мария ГОРИНА, Сооснователь Skiliks
            <br/><br/>
            Мария Горина и её партнёры из компании Skiliks решили по-новому взглянуть на проблему найма профессиональных менеджеров. Они разработали игру, которая позволяет работодателю оценить наличие у кандидата необходимых навыков эффективного управления. Сейчас компания работает над следующим продуктом — игрой, обучающей менеджеров жёстким навыкам работы. Именно на неё Skiliks будет делать основную ставку. Компания планирует выйти на окупаемость в сентябре следующего года.
            <br/>
            <br/>
            <strong>Сфера деятельности:</strong> Онлайн-обучение и оценка персонала
            <br/>
            <strong>Бюджет на запуск:</strong> $300 000
            <br/>
            <strong>Дата старта:</strong> 15 сентября 2013
            <br/>
            <strong>Сайт:</strong> skiliks.com
            <br/>
        </p>

        <h2>
            С чего всё начиналось
        </h2>

        <p>
            Всё началось с моего личностного кризиса. С 2008 года я работала директором по дистрибуции издательства «Эксмо», и в прошлом году я поняла, что существовать в формате топ-менеджера чьей-то компании для меня не очень комфортно. Следующим логичным шагом была должность генерального директора, но простое повышение заработной платы и уровня ответственности больше меня не мотивировали. Я устала быть высокооплачиваемой белкой в красивом колесе и в результате ушла с работы абсолютно в никуда. Встраиваться в чужую модель я больше не хотела и начала думать, к чему у меня по-настоящему лежит душа.
            <br/><br/>
            Так получилось, что тема образования рефреном проходит по моей жизни: я начинала работать как институтский преподаватель, часто вела семинары, организовала «Академию книжного бизнеса». Если я постоянно возвращаюсь к этой теме и она мне глубоко интересна, так почему бы не уделить ей больше внимания, подумала я. Учитывая мой значительный опыт работы в консалтинге и в области управления эффективностью (performance management), я пришла к выводу, что нужно заниматься обучением менеджеров.
        </p>

        <h2>
            Идея
        </h2>

        <p>
            Мои знакомые топ-менеджеры часто жаловались на нехватку удобного, надёжного инструмента, позволяющего набирать себе членов команды. Несмотря на то что у каждого из нас был богатый опыт оценки кандидата во время собеседования, никто не мог точно сказать, как тот проявит себя в деле. Что бы он ни говорил, какой бы опыт работы ни заявлял в резюме, в действительности единственным способом проверить его способности было понаблюдать за ним в процессе работы. Эта нехватка информации приводит к значительному числу ошибок при подборе персонала. Мировая статистика показывает, что 49% менеджеров в первый год работы не удовлетворяют своих работодателей и увольняются. Такие ошибки стоят дорого. При этом хорошо известно, каким образом определённое поведение сотрудника влияет на результаты его работы. Существуют навыки, которые позволяют менеджеру работать быстро, эффективно, не создавая стрессовых ситуаций ни для себя, ни для окружающих. Именно на оценке и обучении этим навыкам я решила сосредоточиться.
        </p>

        <h2>
            Serious Game
        </h2>

        <p>
            Навык — это устоявшийся способ делать что-то с высоким качеством и минимальной тратой ресурсов. Человек сначала должен получить некое знание, а затем применять его на практике: чем чаще, тем лучше, только тогда оно превращается в навык. Для менеджеров существуют базовые, универсальные навыки, которыми они обязаны владеть вне зависимости от специализации компании. Например, это умение определять приоритеты и не реагировать на раздражители, умение делегировать работу, точно определяя, какими ресурсами он владеет, умение правильно выбирать каналы коммуникации, отвечать на звонки и многое другое.
            <br/><br/>
            Мы поняли, что стандартное обучение в формате видеолекций и онлайн-тестов не решит базовую проблему вовлечённости человека и повышения его реального уровня владения предметом. Поэтому решили, что наш продукт можно делать только в формате serious games. Это игры, ориентированные не на развлечение, а на практический результат. Их, например, используют лётчики при обучении управлению самолётом, студенты-хирурги, тренирующиеся делать операции. На Западе в этой плоскости создано уже множество игр, в том числе и для школьников. Они хороши тем, что формируют непосредственный опыт использования знания. Так, например, можно идеально выучить язык по книгам, но растеряться, попав в языковую среду. Это происходит, потому что у человека отсутствует навык практического использования своего багажа знаний. Если же человек играет в serious game, у него появляется чёткое ощущение, что он делал это по-настоящему.
        </p>

        <br/>
        <br/>
        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/the-village-1-2.jpg">
        <br/>
        <br/>

        <h2>
            Оценка и обучение
        </h2>

        <p>
            Мы подумали, что навыки менеджера можно оценить, создав для человека максимально приближенную к его рабочему дню среду. Наша симуляция старательно имитирует интерфейсы и девайсы, а также стандартные задачи, в решении которых проходит день менеджера. В этой привычной среде человек постепенно начинает вести себя так, как обычно ведёт себя на рабочем месте. По нашим наблюдениям, через 30 минут человек расслабляется и забывает, что он играет. Через полтора часа система подсчитывает показатели «технических» характеристик управленца и выводит результаты в виде процентных соотношений. Оценку навыков можно использовать при приёме сотрудника на работу или для проверки уровня квалификации уже существующих менеджеров. Сами менеджеры, заинтересованные в профессиональном развитии и повышении личной эффективности, могут сначала оценить, а затем научиться недостающим навыкам.
            <br/><br/>
            Для этого мы разрабатываем второй продукт: обучающую навыкам игру. Мы не хотим просто давать человеку информацию, наша цель — сформировать у него навык правильного поведения. Для этого он должен повторить одно и то же верное действие множество раз. Допустим, оценка показала, что у вас есть проблема с навыком планирования. Тогда в течение месяца вы будете регулярно получать набор заданий, нацеленных на обучение правильному паттерну планирования. Задания будут связаны как с игровыми кейсами, так и с планированием реального рабочего дня. Каждый день на это нужно будет тратить 15-30 минут, и постепенно у вас сформируется привычка делать вещи именно так, а не иначе. Месяц — не случайный срок: психологи установили, что для формирования устойчивого навыка требуется от 25 до 40 повторений.
        </p>

        <h2>
            Как мы разрабатывали игру
        </h2>

        <p>
            Изначально вся моя команда состояла из Антона Пряничникова, с которым мы раньше вместе работали в «Эксмо». Чуть позже к нам присоединилась Лея Левин, моя давнишняя коллега из «Стратегики», оставившая работу в Accenture. Первые полгода работы мы потратили на формирование теоретической базы. Основываясь на личном опыте, научной литературе, западных методиках управления эффективностью и  консультациях психологов и HR-ов, мы должны были понять, что такое правильный паттерн поведения менеджера и какие навыки в действительности предопределяют его результативность. Как только мы определились со списком навыков, мы начали придумывать ситуации и задания, которые могут выявить наличие или отсутствие этих навыков у менеджера. С этим набором мы обратились к сценаристу, но оказалось, что для написания сценария деловой игры необходима глубокая погружённость человека в контекст задач менеджеров, поэтому многое пришлось переписывать и сочинять самим.
            <br/><br/>
            Затем мы нашли программистов и сначала ошиблись с выбором. Через полгода работы оказалось, что первая IT-команда не справляется с задачей. Наша симуляция очень сложная, потому что, во-первых, состоит из ситуаций, заданных самой системой, а во-вторых, из потока свободных действий, которые генерирует сам игрок. Предусмотреть весь набор действий, которые человек может предпринять, — задача непростая. Мы не соглашались на компромиссы, которые нам предлагали программисты, и понимали, что в дальнейшем игра будет становиться только сложнее и они просто это не потянут. Пришлось искать новых разработчиков, которым это было по силам. Всё это обернулось дополнительными тратами. В целом мы разрабатывали продукт полтора года, за это время потратили около $300 000, большая часть которых ушла на зарплату. Деньги были наши собственные: мои и моих партнёров.
        </p>


        <h2>
            Клиенты
        </h2>

        <p>
            У нас с Леей со времён работы в консалтинге осталось много знакомых бизнесменов. Все они знали, над чем мы работаем, и постоянно спрашивали, когда же уже всё будет готово и можно будет попробовать. Так что нехватки клиентов на старте у нас не было. Самым первым клиентом стало, как ни удивительно, издательство «Эксмо», моё последнее место работы. После тестирования продукта они решили остаться нашим коммерческим клиентом и будут использовать Skiliks как при приёме на работу, так и для обучения внутренних сотрудников.
            <br/><br/>
            Однако в целом мы делаем ставку не на крупный, а на малый и средний бизнес. Наша цель — сделать оценку и обучение навыкам массовым и доступным инструментом, чтобы его могла позволить себе не только крупная компания, но и менеджеры, заинтересованные в развитии своей команды и профессиональном самообразовании. Безусловно, к этой категории относятся не все российские менеджеры, но их достаточно много — людей, знающих цену эффективности, — и их количество будет только расти. Поэтому мы считаем, что у продукта обучения потенциальных клиентов больше, чем у продукта оценки.
        </p>

        <h2>
            Проблемы
        </h2>

        <p>
            Когда выводишь абсолютно новый продукт на рынок, всегда наталкиваешься на сопротивление. По сути, мы заставляем людей выйти за устоявшиеся рамки бизнес-практики, которая им комфортна, потому что привычна, даже если на самом деле они ею не слишком довольны. Это выражается не столько в негативных отзывах, сколько в нежелании пробовать новое. Самая большая проблема для нас — когда люди обещают посмотреть демо-версию продукта, но так никогда и не находят для этого свободных пяти минут. Выкроить время на что-то важное, но несрочное требует от них каких-то невероятных сверхусилий, и я боюсь, что это может серьёзно повлиять на наши продажи на начальном этапе.
        </p>

        <h2>
            Планы
        </h2>

        <p>
            Бизнес-план у нас очень бодрый. Мы рассчитываем выйти на окупаемость к сентябрю следующего года. Примерно через два года мы должны начать зарабатывать. У нас нет задачи заменить своим сервисом HR-службы, но мы хотим естественным образом встроиться в цепочку отбора кандидатов и процесс обучения уже действующих сотрудников. Возможность оценивать и обучаться жёстким навыкам благодаря нам должна стать общедоступной.
        </p>

        <p>
            <strong>Natasha Prokina</strong>, специально для <a class="source" href="http://www.the-village.ru/village/hopesandfears/hopes-experience/152807-skiliks">the-village.ru</a>
            Фотографии: <strong>Мария Минкова</strong>
            <br/>
            <br/>
            <a class="source" href="/static/articles">Все статьи</a>
        </p>
    </span>
</section>
<!--product end-->

<div class="clearfix"></div>