<?php
$this->pageTitle = 'Skiliks - При приеме на работу менеджеров заставляют играть в игры';
//$this->pageDescriptions = '';
//$this->pageKeywords = '';
?>

<!--product-->
<section class="pull-content-center">
    <br/>
    <h1 class="pull-content-center">
        Skiliks: Как заставить менеджеров играть<br/> в серьёзные игры
    </h1>

    <span class="pull-content-center">

        <br/>
        <br/>
        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/the-village-1-1.jpg">
        <br/>
        <br/>

        <p>
            Мария Горина ушла с позиции топ-менеджера крупного издательского дома, чтобы создать игру, обучающую руководителей работать эффективнее.
            <br/>
            Мария Горина и её партнёры из компании Skiliks решили по-новому взглянуть на проблему найма профессиональных менеджеров. Они разработали игру, которая позволяет работодателю оценить наличие у кандидата необходимых навыков эффективного управления.
            <br/>
            Сейчас компания работает над следующим продуктом — игрой, обучающей менеджеров жёстким навыкам работы. Именно на неё Skiliks будет делать основную ставку. Компания планирует выйти на окупаемость в сентябре следующего года.
            <br/>
            Сфера деятельности: Онлайн-обучение и оценка персонала
            <br/>
            Бюджет на запуск: $300 000
            <br/>
            Дата старта: 15 сентября 2013
            <br/>
            Сайт: <a href="www.skiliks.com">www.skiliks.com</a>
            <br/>
        </p>

        <h2>
            С чего всё начиналось
        </h2>

        <p>
            Всё началось с моего личностного кризиса. С 2008 года я работала директором по дистрибуции издательства «Эксмо», и в прошлом году я поняла, что существовать в формате топ-менеджера чьей-то компании для меня не очень комфортно. Следующим логичным шагом была должность генерального директора, но простое повышение заработной платы и уровня ответственности больше меня не мотивировали. Я устала быть высокооплачиваемой белкой в красивом колесе и в результате ушла с работы абсолютно в никуда. Встраиваться в чужую модель я больше не хотела и начала думать, к чему у меня по-настоящему лежит душа.
            <br/>
            Так получилось, что тема образования рефреном проходит по моей жизни: я начинала работать как институтский преподаватель, часто вела семинары, организовала «Академию книжного бизнеса». Если я постоянно возвращаюсь к этой теме и она мне глубоко интересна, так почему бы не уделить ей больше внимания, подумала я. Учитывая мой значительный опыт работы в консалтинге и в области управления эффективностью (performance management), я пришла к выводу, что нужно заниматься обучением менеджеров.
        </p>

        <h2>
            Идея
        </h2>

        <p>
            Мои знакомые топ-менеджеры часто жаловались на нехватку удобного, надёжного инструмента, позволяющего набирать себе членов команды. Несмотря на то что у каждого из нас был богатый опыт оценки кандидата во время собеседования, никто не мог точно сказать, как тот проявит себя в деле. Что бы он ни говорил, какой бы опыт работы ни заявлял в резюме, в действительности единственным способом проверить его способности было понаблюдать за ним в процессе работы. Эта нехватка информации приводит к значительному числу ошибок при подборе персонала. Мировая статистика показывает, что 49% менеджеров в первый год работы не удовлетворяют своих работодателей и увольняются. Такие ошибки стоят дорого. При этом хорошо известно, каким образом определённое поведение сотрудника влияет на результаты его работы. Существуют навыки, которые позволяют менеджеру работать быстро, эффективно, не создавая стрессовых ситуаций ни для себя, ни для окружающих. Именно на оценке и обучении этим навыкам я решила сосредоточиться.
        </p>

        <h2>
            Serious Game
        </h2>

        <p>
            Навык — это устоявшийся способ делать что-то с высоким качеством и минимальной тратой ресурсов. Человек сначала должен получить некое знание, а затем применять его на практике: чем чаще, тем лучше, только тогда оно превращается в навык. Для менеджеров существуют базовые, универсальные навыки, которыми они обязаны владеть вне зависимости от специализации компании. Например, это умение определять приоритеты и не реагировать на раздражители, умение делегировать работу, точно определяя, какими ресурсами он владеет, умение правильно выбирать каналы коммуникации, отвечать на звонки и многое другое.
            <br/>
            Мы поняли, что стандартное обучение в формате видеолекций и онлайн-тестов не решит базовую проблему вовлечённости человека и повышения его реального уровня владения предметом. Поэтому решили, что наш продукт можно делать только в формате serious games. Это игры, ориентированные не на развлечение, а на практический результат. Их, например, используют лётчики при обучении управлению самолётом, студенты-хирурги, тренирующиеся делать операции. На Западе в этой плоскости создано уже множество игр, в том числе и для школьников. Они хороши тем, что формируют непосредственный опыт использования знания. Так, например, можно идеально выучить язык по книгам, но растеряться, попав в языковую среду. Это происходит, потому что у человека отсутствует навык практического использования своего багажа знаний. Если же человек играет в serious game, у него появляется чёткое ощущение, что он делал это по-настоящему.
        </p>

        <h2>
            Оценка и обучение
        </h2>

        <p>
            Мы подумали, что навыки менеджера можно оценить, создав для человека максимально приближенную к его рабочему дню среду. Наша симуляция старательно имитирует интерфейсы и девайсы, а также стандартные задачи, в решении которых проходит день менеджера. В этой привычной среде человек постепенно начинает вести себя так, как обычно ведёт себя на рабочем месте. По нашим наблюдениям, через 30 минут человек расслабляется и забывает, что он играет. Через полтора часа система подсчитывает показатели «технических» характеристик управленца и выводит результаты в виде процентных соотношений. Оценку навыков можно использовать при приёме сотрудника на работу или для проверки уровня квалификации уже существующих менеджеров. Сами менеджеры, заинтересованные в профессиональном развитии и повышении личной эффективности, могут сначала оценить, а затем научиться недостающим навыкам.
            <br/>
            Для этого мы разрабатываем второй продукт: обучающую навыкам игру. Мы не хотим просто давать человеку информацию, наша цель — сформировать у него навык правильного поведения. Для этого он должен повторить одно и то же верное действие множество раз. Допустим, оценка показала, что у вас есть проблема с навыком планирования. Тогда в течение месяца вы будете регулярно получать набор заданий, нацеленных на обучение правильному паттерну планирования. Задания будут связаны как с игровыми кейсами, так и с планированием реального рабочего дня. Каждый день на это нужно будет тратить 15-30 минут, и постепенно у вас сформируется привычка делать вещи именно так, а не иначе. Месяц — не случайный срок: психологи установили, что для формирования устойчивого навыка требуется от 25 до 40 повторений.
        </p>

        <p>
            Автор: <strong>Natasha Prokina</strong>
            <br/>
            Фотограф: <strong>Мария Минкова</strong>
            <br/>
            <span class="pull-right">
                Читайте лалее на <a class="source" href="http://www.the-village.ru/village/hopesandfears/hopes-experience/152807-skiliks">the-village.ru</a>
            </span>
            <br/>
            <br/>
            <a class="source" href="/static/articles">Все статьи</a>
        </p>
    </span>
</section>
<!--product end-->

<div class="clearfix"></div>