<?php
$this->pageTitle = 'Skiliks - При приеме на работу менеджеров заставляют играть в игры';
//$this->pageDescriptions = '';
//$this->pageKeywords = '';
?>

<!--product-->
<section class="pull-content-center">
    <br/>
    <h1 class="pull-content-center">
        При приеме на работу менеджеров заставляют играть в игры
    </h1>

    <span class="pull-content-center">

        <br/>
        <br/>

        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/vedomosti-1-1.jpg">
        <br/>
        <br/>

        <p>
            По сути Skiliks — это своеобразный симулятор рабочего дня менеджера. Игроку предлагается два часа побыть начальником аналитического отдела, у которого осталось два дня до отпуска, а дел выше крыши. «Утро начинается с того, что по дороге на работу прокалывается шина, он опаздывает, а в офисе на него начинают сыпаться разные дела», — рассказывает Антон Пряничников, совладелец компании Skiliks, разработавший игру-симулятор. До 11.00 у аналитика есть время спланировать день, выбрать, что сегодня стоит сделать, после чего одновременно ему приходится решать десятки задач: отвечать на письма и звонки, встречаться с клиентами, беседовать с генеральным директором, исправлять ошибки в отчете. Все от него чего-то хотят — отделы финансов, логистики, производственники, руководители. Подчиненный по фамилии Трутнев жалуется, что не может справиться с работой. Игрок активно вовлечен в игру: требуются не простые ответы «да» или «нет», а, к примеру, нужно подсчитать бюджет в Excel, найти ошибки в расчетах, уточняет Пряничников. Обмануть симулятор непросто: человек 15-20 минут может придерживаться модели, которую считает правильной, но потом начинает вести себя привычным способом, объясняет он. К тому же тест ограничен по времени: испытуемый начальник отдела аналитики должен к 18.00 освободиться, чтобы успеть на день рождения тещи, ему постоянно названивает жена. Во время теста оценивается еще и умение человека выстроить баланс между личной жизнью и работой, подчеркивают разработчики.
            <br/>
            <br/>
            Поначалу создатели симулятора предполагали, что это инструмент для оценки кандидатов на руководящие должности, но 90% клиентов начали использовать игру для тестирования собственных менеджеров, рассказывает Пряничников. Оценка игроку выставляется по трем параметрам: результативности, управленческим навыкам и умению использовать время. В свою очередь, оценка управленческих навыков, например, дробится на более мелкие — управления людьми, коммуникациями, задачами с учетом приоритетов. Есть опция, позволяющая скрыть результат от самого игрока.
        </p>

        <h2>
            Вычислить таймкиллера
        </h2>

        <p>
            Компьютерный тест для оценки собственных руководителей или кандидатов уже используют в Пробизнесбанке, издательстве «Эксмо», финансовой группе «Лайф», Strategy Partners Group, компании «Август», издательстве «Манн, Иванов и Фербер», «Брок-инвест-сервисе», рассказал Пряничников.
            <br/><br/>
            В «Эксмо» через эту симуляцию пропустили 50 собственных линейных менеджеров, рассказывает Анатолий Норовяткин, директор по дистрибуции издательства. Игра хороша для оценки навыков менеджеров среднего звена, например руководителей отделов продаж, менеджеров, работающих с ключевыми клиентами, считает он. Когда в издательстве сравнили оценку, выданную после игры со своими внутренними оценками, то они оказались очень похожими.
            <br/><br/>
            Директор по дистрибуции «Эксмо» сам одним из первых поиграл в Skiliks. Он узнал, что не всегда рационально использует время. Даже эффективный менеджер может вынести из этого для себя пользу, убежден Норовяткин. «Я знал, что часто отвлекаюсь на электронную почту, и симуляция лишний раз подтвердила, что привычку нужно менять, — рассказывает он. — Проверять почту надо только три раза в день: утром, в обед и вечером».
            <br/><br/>
            Конечно, такая оценка — не догма и не истина в последней инстанции, а всего лишь еще один инструмент для выявления возможных точек роста, говорит он. Тест оценивает прежде всего навыки оперативного управления. «Например, если бы я прошел эту симуляцию, то, вероятно, показал бы не самый лучший результат: я уже отошел от оперативной работы», — рассказал Агабеков. Зато один из его подчиненных генеральных директоров получил наивысший бал.
        </p>

        <h2>
            Проверить себя на прочность
        </h2>

        <p>
            В отличие от интервью ролевая игра позволяет больше узнать о навыках управленца, в игре человек лучше раскрывается, замечает Кирилл Данилов, менеджер рекрутинговой компании Antal Russia. «Наши компании-клиенты используют похожие методики оценки в рекрутинге и ассесменте, — уточняет он. — Правда, руководители старшего поколения, да и просто опытные менеджеры, особенно в регионах, часто отказываются от такого тестирования, воспринимая его как унизительное». Однако рекрутерам часто удается переубедить кандидатов. «Мы говорим им, что это хороший способ проверить себя, насколько ты способен работать в стрессовых условиях, под прессингом», — уточняет Данилов.
            <br/><br/>
            Методика может стать одной из альтернатив олдскульному ассессменту, на который иногда приходится тратить целый рабочий день, да еще и подключать консультантов, считает Агабеков. Симулятор же сам автоматически подсчитывает результат.
            <br/><br/>
            Деловые игры действительно позволяют провести оценку в более сжатые сроки и в мировой практике их популярность растет, добавляет Данилов: «На основе результатов игрового тестирования компании могут строить систему тренингов и развивать именно те компетенции, которых менеджерам не хватает».
            <br/><br/>
            В компаниях, в которых по 50-100 сотрудников уже поиграли в Skiliks, возник закономерный вопрос: что делать с результатами тестирования? «Вот почему в апреле выйдет обновленная версия игры, в которой акцент будет сделан не только на оценку навыков менеджера, но и на разработку индивидуального плана развития и диагностики навыков по компании в целом», — рассказывает Пряничников. К примеру, можно будет сравнивать управленческий потенциал команды со средним по рынку или по отрасли, сравнивать показатели разных отделов и команд внутри компании, добавляет он.
        </p>
        <p>
            <strong>Елена Горелова</strong>, специально для <a class="source" href="http://www.vedomosti.ru/career/news/24846471/rukovoditel-vpadaet-v-yunost?full#cut">Vedomosti.ru</a>
            <br/>
            <br/>
            <a class="source" href="/static/articles">Все статьи</a>
        </p>
    </span>
</section>
<!--product end-->

<div class="clearfix"></div>