<?php
$this->pageTitle = 'Skiliks - При приеме на работу менеджеров заставляют играть в игры';
//$this->pageDescriptions = '';
//$this->pageKeywords = '';
?>

<!--product-->
<section class="pull-content-center">
    <br/>
    <h1 class="pull-content-center">
        Бизнес и практика. <br/>Skiliks можно использовать для оценки потребности в обучении и для оценки эффективности тренингов, проводя замеры до и после
    </h1>

    <span class="pull-content-center">

        <br/>
        <br/>

        <img class="illustration" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-1.jpg">
        <br/>
        <br/>

        <p>
            Когда вы берете на работу менеджера, чего именно ожидаете от него? Когда вы приходите в компанию на позицию менеджера, как планируете строить свою работу? Команда Skiliks разработала онлайн симуляцию, позволяющую проверить базовые навыки менеджера. Zillion посмотрел, как это устроено, а представитель рассказал, как происходит автоматизированная оценка управленческих навыков в формате Serious Game.
        </p>

        <h2>
            Что такое Skiliks?
        </h2>

        <p>
            Skiliks – это онлайн симуляция, позволяющая проверить и оценить базовые навыки менеджера. По каждому кандидату составляется отчет о результативности и проявленных навыках менеджера. Кандидату потребуется 2-3 часа, чтобы пройти игру. Ее специфика – в глубоком погружении в реальную рабочую среду. Игра ставит менеджерские задачи и помещает человека в виртуальные ситуации, где необходимо принять управленческие решения. Можно по шкале оценки навыков, качеств и достигнутых результатов сравнить между собой кандидатов с разным опытом, из разных отраслей или регионов. Создатели сервиса – Мария Горина и Антон Пряничников. К разработке симуляции привлекались эксперты в области управления, психологии, оценки и обучения.
            <br/>
            Мария Горина некоторое время назад по своему решению покинула позицию топ-менеджера издательства «Эксмо» (позже оно стало клиентом Skiliks), чтобы заняться каким-то вдохновляющим проектом. Антон Пряничников также занимал руководящую позицию в «Эксмо» – занимался запуском онлайн медиапроектов. Имеет значение: Антон изучал прикладную математику в Киевском политехническом институте. Знания создателей Skiliks в итоге дали синергетический эффект при реализации и настройке сервиса.
        </p>

           <br/>
            <iframe width="549" height="320" style="margin-left: 50px;" frameborder="0" src="http://player.vimeo.com/video/61279471?title=0&amp;byline=0&amp;portrait=0&amp;color=24bdd3"></iframe>
            <br/>

        <h2>
            Кому полезно и для чего применять?
        </h2>

        <p>
            Онлайн симуляция рабочего процесса может быть использована для оценки навыков сотрудников и при приеме менеджера на работу. Учитываются только базовые менеджерские навыки, ориентированные на результат. Важный момент: стандарты, по которым происходит оценка, ориентированы на базовые и средние руководящие позиции и специалистов, частично выполняющих управленческие функции. Специфические требования компании не учитываются – акцент делается на универсальные требования к менеджеру. В процессе игры происходит тестирование 70% менеджерских навыков, ежедневно используемых в работе.
            <br/>
            Skiliks будет особенно полезен для руководителей подразделений компаний, HR-специалистов, собственников бизнеса, рекрутинговых и HR-агентств. Можно тестировать с помощью Skiliks и уже давно работающих коллег, чтобы яснее увидеть их сильные и слабые стороны – и в зависимости от результатов понять корреляцию с индивидуальными успехами, эффективностью подразделения (увидеть «дыры» в рабочем процессе).
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-2.jpg">
        <br/>
        <br/>

        <h2>
            Экономия времени и ресурсов
        </h2>

        <p>
            С помощью Skiliks можно высвободить часы, которые обычно тратятся на предварительные интервью с кандидатами, использовать это время для других важных дел. Сервис позволяет тестировать любое количество людей онлайн по всему миру. Специального физического пространства, дополнительных компьютеров, установки софта и вовлечения экспертов не нужно.
        </p>

        <h2>
            Демо и виртуальная рабочая реальность
        </h2>

        <p>
            Посмотреть, как это работает, можно в 5-минутной демоверсии. В полной версии есть дополнительные функции, такие как написание писем, возможность позвонить самому и уйти на встречу. Оценка действий также проводится только в полной версии.
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-3.jpg">
        <br/>
        <br/>

        <p>
            Демо стоит не просто поверхностно посмотреть, а хорошо изучить и вникнуть в детали. Это очень интересно. В симуляции пользователь действительно погружается в рабочую атмосферу: ожидается, что он будет воспроизводить свои реальные профессиональные действия, а не «играть в игрушки». Мы сразу видим симуляцию рабочего стола и набор иконок (справка, планировщик, телефон, почта, дверь и документы). В информационном блоке дано описание структуры компании, рабочих задач, коллег, их отношения к вам. В папке лежат реалистично выглядящие отчеты. Вам звонят клиенты, перенося встречи из-за опозданий, коллеги, возмущенные недостатком отчетных данных, и т. д. Общаясь с коллегами, руководством и клиентами, надо вести себя так, как вы вели бы себя в жизни, нацеливаясь на эффективную работу. То есть выбирать вариант ответа, выстраивая линию поведения, за которой стоят ваши менеджерские принципы. Параллельно приходят новые письма, в каждом из которых содержится конкретная просьба или задача. Интересно, что все это не «для красоты»: нужно действительно вникать в содержание писем, выбирать формулировки ответов, пересылать нужные файлы и так далее. Эта подробность симуляции действительно заинтересовывает и вовлекает.
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-4.jpg">
        <br/>
        <br/>

        <p>
            Проходя тестирование, нужно психологически настроиться на рабочий режим и не путать Serious Game с развлекательными играми. К примеру, если вы начинаете не к месту реагировать на раздражители, распылять внимание и читать новые письма в интерфейсе игры, разговаривая с клиентом, то ваши действия могут быть истолкованы не самым выгодным образом. Менеджер на то и менеджер, чтобы грамотно управлять, прежде всего, собой.
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-5.jpg">
        <br/>
        <br/>

        <p>
            Создатели Skiliks понимают, что человеку нужно время, чтобы «вовлечься»: замечено, что это вовлечение в искусственную рабочую реальность происходит достаточно быстро. Таким образом, за пару часов можно составить представление о том, по каким принципам вы «живете» в рабочем процессе, какие алгоритмы решения задач и стиль ведения дел вам свойственны. Длительность теста – приемлемая, на дорогу до офиса кандидат наверняка затратит больше времени.
            <br/>
            Полная симуляция Skiliks имеет больший набор функций, дает возможность самостоятельных действий и делает расчет оценки.
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-6.jpg">
        <br/>
        <br/>

        <h2>
            Как проходят тестирование и оценка?
        </h2>

        <p>
            При регистрации можно выбрать индивидуальный профиль (как сотрудник или соискатель) и корпоративный (как работодатель).
            <br/>
            Профиль сотрудника и соискателя подразумевает возможность получать приглашения от работодателя, выбрать в меню профессиональный статус (от студента до высшего руководства и собственника). Полная версия доступна по приглашению, а демоверсия с ограниченной функциональностью бесплатна. Корпоративный профиль и полная версия сервиса дают 3 бесплатных симуляции, пакет симуляций для оценки кандидатов и сотрудников, инструмент оценки прогресса, возможность выбрать отрасль и др.
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-7.jpg">
        <br/>
        <br/>

        <p>
            Чтобы протестировать кого-либо, необходимо отправить приглашение, указав имя, фамилию и email. Менеджер получит приглашение с активационной ссылкой, зарегистрируется и из личного кабинета запустит симуляцию, а дальше в течение 2 часов будет демонстрировать свои навыки и принципы в ситуациях с неочевидными решениями.
            <br/>
            После теста работодатель, зарегистрированный как корпоративный пользователь, получит доступ к результатам и сможет сравнить показатели нескольких человек. Чтобы убедиться, что симуляцию проходил именно тот человек, которому отправлено приглашение, при личной встрече можно задать те же вопросы, которые возникали в процессе игры-теста.
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-8.jpg">
        <br/>
        <br/>

        <p>
            Итоговый рейтинг менеджера составляется из его показателей по направлениям:
            <br/>
            1. управленческие навыки (управление задачами с учетом приоритетов, управление людьми и коммуникациями);
            <br/>
            2. результативность (количество и значимость выполненных задач);
            <br/>
            3. эффективность использования времени (сколько времени затрачено на задачи, как оно распределено, затрачено ли сверхурочное время).
            <br/>
            Skiliks использует математические методы анализа поведения, и это принципиально, когда речь идет о подборе менеджера. Личное обаяние и другие «внешние эффекты» воздействуют на человека, который проводит собеседование, но это субъективные ощущения, с рабочими задачами кандидат может не совпадать. Принятый только из личной симпатии, он потеряет время и получит неприятные эмоции, если не справится и будет уволен во время испытательного срока. Компания при этом потеряет время и некоторые деньги. Так что нельзя сказать, что Skiliks заточен только под работодателя: обе стороны заинтересованы в том, чтобы подойти друг другу по-настоящему.
        </p>

        <br/>
        <br/>
        <img class="illustration-small" src="<?= $this->assetsUrl ?>/img/site/1280/articles/photos/zillion-1-9.jpg">
        <br/>
        <br/>

        <p>
            Человек – сложная система с массой неочевидных преимуществ/недостатков, факторов влияния и критериев полезности в работе. И Skiliks достаточно аккуратен в позиционировании: речь идет о дополнительном инструменте, об оценке основополагающих навыков менеджеров базового и среднего звена. Команда не рекомендует использовать сервис для оценки топов, поскольку «состав» их успешности – сложнее.
            <br/>
            Интересно, что каждый навык менеджера тестируется около 10 раз в той или иной форме. Исходным тут является понимание навыка: это управляемая способность человека выдавать конкретные результаты, затрачивая минимум ресурсов. Сценарий симуляции и система оценки основаны на эффективной управленческой тактике.
            <br/>
            В каком-то смысле Skiliks ведет исследование. Сервис совершенствуется, реагируя на обратную связь от HR-специалистов, поэтому сымитированные ситуации – в высокой степени «рабочие» и репрезентативные. Так или иначе, они дают соискателю или сотруднику возможность показать себя в деле. Данные тестирования разных участников анализируют, чтобы совершенствовать настройку симуляции.
            <br/>
            Можно отметить такой момент: эта практика довольно интересна в контексте «оздоровления» профессии. Слово «менеджер» в последние годы приобрело размытое значение (название без реального управленческого образования и умений). Тестирование с математической оценкой навыков способно дать тонизирующий эффект и вдохновить представителей профессии на получение новых знаний.
        </p>

        <h2>
            Сколько это стоит?
        </h2>

        <p>
            Ознакомление через демоверсию – бесплатно. Тарифы такие: Lite – 11 970 рублей за 3 симуляций; Starter – 34 900 рублей за 10 симуляций, Professional – 64 900 рублей за 20 симуляций и Business – 149 500 рублей за 50 симуляций. Плюс везде бесплатные обновления.
        </p>

        <h2>
            Новая версия
        </h2>

        <p>
            Вчера вышла новая версия. Теперь сервис Skiliks можно использовать в браузерах Internet Explorer 10 и 11. В рабочем кабинете корпоративного пользователя добавлена инструкция по интерпретации результатов оценки. Пошагово изложен алгоритм анализа полученных результатов. Сводный аналитический отчет по всем людям, прошедшим тестирование, выгружается в Excel. В результатах оценки добавлены детальное описание каждого показателя и PDF-отчет с оценками и описанием показателей. Повышены стабильность процесса тестирования и точность результатов. Плюс улучшили работу настроек безопасности, сделали кабинет и симуляцию немного удобнее.
            <br/>
            Мы задали сооснователю Skiliks несколько вопросов, ответы на которые могут волновать многих, когда речь идет об автоматизированной оценке профессиональной состоятельности.
        </p>

        <h2>
            Представитель Skiliks: «Skiliks можно использовать для оценки потребности в обучении и для оценки эффективности тренингов, проводя замеры до и после»
        </h2>

        <p>
            Комментирует сооснователь Skiliks
        </p>

        <p>
            <strong>
                По каким критериям оцениваются навыки и эффективность менеджеров/соискателей – какие стандарты использованы и в какой мере это можно унифицировать? Различаются ли критерии оценки базовых навыков в зависимости от отрасли?
            </strong>
            <br/>
            – Основной измеряемый показатель – результативность, объем управленческих задач, которые менеджер должен выполнить сам, своими руками. Управленческие навыки, которые менеджер использовал для достижения данной результативности, оцениваются по 100% шкале уровня владения навыками, где показатель 100% по навыку означает, что менеджер во всех ситуациях продемонстрировал эффективное поведение, отражающее безупречное владение данным навыком.
            <br/>
            В качестве таких «поведений» отобраны наиболее эффективные способы решения управленческих задач, признанные в международной и российской практике, они универсальны для всех отраслей и типов компаний. Единственная их особенность – это стандарты поведения результатоориентированного менеджера, то есть если создание результата не является основной задачей менеджера, то набор необходимых ему навыков будет, вероятно, другим.
        </p>

        <p>
            <strong>
                В чем заключается правильный паттерн поведения менеджера?
            </strong>
            <br/>
            – Эффективный менеджер точно определяет свои приоритеты исходя из целей и ограничений его подразделения, планирует свою работу и работу своего подразделения в соответствии с ними, гибко реагирует на изменения приоритетов и в каждый момент времени занят самой приоритетной задачей из всех имеющихся, не отвлекаясь на менее приоритетные задачи.
            <br/>
            Он оптимальным образом управляет загрузкой своих сотрудников, ставит им задачи и контролирует работу, дает обратную связь, учитывая области их компетенций, уровень квалификации, мотивации, решая текущие задачи и развивая команду.
            <br/>
            Эффективный менеджер оптимальным образом использует различные каналы коммуникации для решения стоящих перед ним задач, то есть для каждой задачи он использует тот способ коммуникации, который с наименьшими затратами даст желаемый результат, – и достигает этого результата.
        </p>

        <p>
            <strong>
                Что вы думаете о следующих мнениях?
                <br/>
                «Позитивные и негативные проявления человеческого фактора в работе разнообразны – и уровень профессионализма заключается не только в конкретных навыках».
            </strong>
            <br/>
            – Конечно, личностные качества оказывают существенное влияние на эффективность менеджера. Многие личностные качества облегчают формирование навыков эффективной работы – устойчивых способов достижения результата с минимальной тратой ресурсов. Мы не измеряем все возможные проявления человеческого фактора как самоцель, нас интересуют только те навыки и личностные качества, которые можно замерить и оценить в рамках компьютерной симуляции и которые непосредственным образом влияют на результативность в долгосрочном плане.
        </p>

        <p>
            <strong>
                «Конкретная работа в конкретной компании может подходить одному человеку и не подходить другому с той же квалификацией – есть сложно измеряемые факторы влияния».
                <br/>
                Какую позицию Skiliks занимает в отношении сложно измеряемых характеристик человека и среды, влияющих на рабочую эффективность?
            </strong>
            <br/>
            – В данной симуляции мы смотрим только на то, что человек сделал, а что – нет, какое действие в какой ситуации он предпринял. Мы не знаем, что он при этом чувствовал и о чем думал, и мы не измеряем его мотивацию. Нам важны только конечный результат и действия, его обеспечившие. Мы смотрим, как человек справляется со стандартными управленческими задачами, с работой в жестких временных рамках, с конфликтующими по приоритетам задачами, с потоком отвлекающих факторов. Среда, которую мы создали, довольно стрессовая, мало кто из руководителей живет в таком режиме постоянно. Но такая жесткая среда позволяет нам протестировать верхнюю границу способностей менеджера и дифференцировать их между собой.
        </p>

        <p>
            <strong>
                Может ли соискатель/сотрудник подгонять свои ответы под представления о том, как должно быть?
                <br/>
                Есть ли риск отсеивания подходящих кандидатов из-за того, что кто-то просто умеет хорошо проходить тесты, предполагая ожидания и выстраивая идеальную картинку?
                <br/>
                И такой момент: многие люди осознают, как должно быть, но на деле не умеют организовывать свою работу нужным образом.
            </strong>
            <br/>
            – Именно невозможностью подгонять ответы под «правильные» представления и отличается симулятор от обычного опросника. Потому что в симуляторе никто никаких вопросов не задает, нет вариантов действий, из которых можно что-то выбрать или догадаться, что правильно, вспомнив прочитанное в книжке по менеджменту или пример друга.
            <br/>
            В симуляторе есть список задач и инструменты – email, телефон, планировщик, документы. Какие задачи делать, а какие нет; делать самой или делегировать; если делегировать, то кому, когда и как; если делать самостоятельно, то когда и как – звонить, писать сообщение и о чем, встречаться и с кем? И вообще, кто сказал, что надо что-то делать? Все это нужно решить самостоятельно, без каких-либо подсказок. Более того, все проходившие симуляцию отмечают, что уже через 15 минут они не играют, а работают, демонстрируя свою типичную модель поведения в таких ситуациях. Поэтому навык прохождения тестов не помогает в симуляторе, где нужно действовать самостоятельно без вариантов ответов.
            <br/>
            Навык и знание тем и отличаются: можно знать, как правильно, но не делать так в жизни, делать так не всегда или только в особо благоприятных условиях. Поэтому в алгоритме оценки навыков мы смотрим на действия, которые менеджер предпринял сам, когда у него была полная свобода выбора, как часто и в каких ситуациях он демонстрировал аналогичное эффективное или неэффективное поведение.
            <br/>
            Конечная оценка по навыку собирается из оценок по очень детальным поведениям, являющимся проявлением данного навыка, каждое поведение измеряется в среднем на десяти ситуациях по ходу симуляции. Из-за множественности факторов влияния и неочевидности того, в какой момент какое поведение оценивается, невозможно угадать, как действие в конкретной ситуации скажется на оценке навыка.
        </p>

        <p>
            <strong>
                Насколько культура Serious Games развита в мире?
            </strong>
            <br/>
            – В США и Европе «серьезные игры» очень активно используются в обучении, сейчас это один из наиболее растущих сегментов образовательного рынка. Поняв эффективность «серьезных игр» в части ускоренного создания нового личного опыта, компании все чаще прибегают к ним для обучения конкретным процессам и задачам.
        </p>

        <p>
            <strong>
                Можно ли использовать Skiliks в образовательных целях, для улучшения менеджерских навыков?
                <br/>
                Когда будет представлен второй продукт – обучающая игра Skiliks для развития навыков?
            </strong>
            <br/>
            – В настоящий момент Skiliks можно использовать для оценки потребности в обучении, а также для оценки эффективности используемых тренингов, проводя замеры до и после. Мы ведем разработку обучающей симуляции, конкретные сроки выхода сможем назвать позже. Новостями делимся на нашей странице в Facebook.
        </p>

        <p>
            <strong>
                В каком направлении будет развиваться Skiliks?
            </strong>
            <br/>
            – Мы работаем над удобством симуляции и сервиса в целом, возможностями не только оценивать менеджеров, но и сравнивать их результаты по различным основаниям, готовим симуляцию по развитию навыков.
        </p>

        <p>
            <strong>Анастасия Подберезкина</strong>, Шеф-редактор <a target="_blank" class="source" href="http://zillion.net/ru/blog/470/skiliks-otsienka-riezul-tativnosti-i-bazovykh-navykov-mieniedzhiera">zillion.net</a>
            <br/>
            Иллюстрация обложки: <strong>Vadim Sherbakov</strong>
            <br/>
            <a class="source" href="/static/articles">Все статьи</a>
        </p>
    </span>
</section>
<!--product end-->

<div class="clearfix"></div>