<?php
/**
 * Используется на попапе Лицензионного соглашения и в помощи
 */
?>
<p>Лицензионное соглашение на использование программы "Тестирование навыков менеджера"
    и условия использования сайта www.skiliks.com от 15.04.2014
</p>
<p>Перед использованием сайта и программы, пожалуйста, ознакомьтесь с условиями и лицензионным соглашением.
    Любое использование вами сайта и программы означает полное и безоговорочное принятие вами данных условий.</p>
<p>Если вы не принимаете условия использования сайта и  лицензионного соглашения в полном объеме, вы не имеете
    права использовать сайт и программу в каких-либо целях.
    Лицензионное соглашение на использование программы "Тестирование навыков менеджера"</p>
<br/>
<h4 class="margin-bottom-standard">Лицензионное соглашение на использование программы "Тестирование навыков менеджера"</h4>
<h6 class="margin-bottom-standard">1. Общие положения</h6>
<p>1.1. Настоящее Лицензионное соглашение ("Лицензия") устанавливает условия использования программы для ЭВМ
    "Тестирование навыков менеджера" ("Программа") и заключено между любым лицом, использующим
    Программу ("Пользователь"), и ООО "СКИЛИКС", ИНН      7743866434, являющимся правообладателем
    неисключительного права на воспроизведение и использование Программы ("Правообладатель").</p>
<p>1.2. Используя Программу любым образом, Пользователь выражает свое полное и безоговорочное согласие
    со всеми условиями Лицензии. </p>
<p>1.3. Использование Программы разрешается только на условиях настоящей Лицензии. Если Пользователь не
    принимает условия Лицензии в полном объеме, Пользователь не имеет права использовать Программу в каких-либо целях.
    Использование Программы с нарушением (невыполнением) какого-либо из условий Лицензии запрещено.</p>
<p>1.4. Использование Программы на условиях настоящей Лицензии осуществляется в соответствии с тарифами,
    указанными на сайте Правообладателя (http://skiliks.com/static/tariffs). Согласно выбранному тарифу
    Пользователю предоставляется право доступа к симуляциям. Использование Программы на условиях и способами,
    не предусмотренными настоящей Лицензией, возможно только на основании отдельного соглашения с Правообладателем.</p>
<p>1.5. К настоящей Лицензии и всем отношениям, связанным с использованием Программы, подлежит применению
    действующее законодательство Российской Федерации и любые претензии или иски, вытекающие из настоящей
    Лицензии или использования Программы, должны быть поданы и рассмотрены в порядке, установленном
    действующим законодательством Российской Федерации в Арбитражном суде города Москвы.</p>

<h6 class="margin-bottom-standard us-margin-top">2. Права на Программу</h6>
<p>2.1. Неисключительное право на воспроизведение и использование Программы принадлежит Правообладателю
    на основании лицензионного договора с авторами Программы.</p>

<h6 class="margin-bottom-standard us-margin-top">3. Лицензия</h6>
<p>3.1. Правообладатель на условиях простой (неисключительной) лицензии, предоставляет Пользователю
    непередаваемое право доступа в интерактивном режиме к экземпляру Программы, размещенному на сервере
    Правообладателя, без предоставления Пользователю технической возможности и права воспроизведения
    экземпляров Программного обеспечения, в том числе путем записи на электронном носителе или в
    память ЭВМ на территории стран всего мира следующими способами:</p>
<p>3.1.1. Использовать Программу по прямому функциональному назначению, описанному на сайте Правообладателя (www.skiliks.com)</p>

<h6 class="margin-bottom-standard us-margin-top">4. Ограничения</h6>
<p>4.1. За исключением использования в объемах и способами, прямо предусмотренными настоящей
    Лицензией или законодательством РФ, Пользователь не имеет права воспроизводить один и
    более экземпляров Программы. При этом допускается такая запись пользователями, которая
    является временной и составляет неотъемлемую и существенную часть технологического процесса,
    имеющего единственной целью правомерное использование записи путем практического применения
    (в значении, данном этому понятию в пункте 3 статьи 1270 ГК РФ) - такая запись для целей настоящей
    статьи воспроизведением не считается</p>
<p>4.2. Пользователь не имеет права изменять, декомпилировать, дизассемблировать, дешифровать и
    производить иные действия с объектным кодом Программы, имеющие целью получение информации о реализации
    алгоритмов, используемых в Программе, создавать производные произведения с использованием Программы,
    а также осуществлять (разрешать осуществлять) иное использование Программы, без письменного согласия
    Правообладателя</p>

<h6 class="margin-bottom-standard us-margin-top">5. Условия использования отдельных функций Программы</h6>
<p>5.1. Пользователь настоящим уведомлен и соглашается, что Правообладателю с целью формирования отчёта
    по результатам тестирования в автоматическом режиме сообщается информация о действиях пользователя
    при использовании Программы.</p>
<p>5.2. Функции Программы выполняются с помощью технологий Правообладателя, а также технологий партнеров
    Правообладателя. В частности, функции работы он-лайн поддержки выполняется с помощью технологий
    компании SiteHeart (http://siteheart.com).</p>

<h6 class="margin-bottom-standard us-margin-top">6. Ограничение ответственности по Лицензии</h6>
<p>6.1. Программа предоставляется на условиях "как есть" (as is) и при условии оплаты платежей,
    необходимых для доступа к Программе. Правообладатель не предоставляет
    никаких гарантий в отношении безошибочной и бесперебойной работы Программы, соответствия Программы
    конкретным целям и ожиданиям Пользователя, а также не предоставляет никаких иных гарантий, прямо не
    указанных в настоящей Лицензии.</p>
<p>6.2. В максимальной степени, допустимой действующим законодательством, Правообладатель не несет никакой
    ответственности за какие-либо прямые или косвенные последствия какого-либо использования или невозможности
    использования Программы и/или ущерб, причиненный Пользователю и/или третьим сторонам в результате
    какого-либо использования или неиспользования Программы, в том числе из-за возможных ошибок или сбоев
    в работе Программы.</p>
<p>6.3. Пользователь настоящим уведомлен и соглашается, что при использовании Программы Правообладателю
    в автоматическом режиме передается следующая информация: тип операционной системы компьютера
    Пользователя, статистика использования элементов Программы, а также иная техническая информация.</p>
<p>6.4 Пользователь настоящим уведомлён, что технические средства Пользователя, необходимые для использования
    Программы, должны удовлетворять следующим требованиям:</br>
    Операционная система: Windows начиная с Win XP или Mac OS X - начиная с 10.7</br>
    CPU - двухядерный и выше</br>
    RAM - 2 Гбайта и выше</br>
    Скорость Интернет - 2 Мбит/сек download; 200 Кбит/сек upload и выше</br>
    Браузеры: Mozilla Firefox 18 и выше, Google Chrome 27 и выше, Internet Explorer 10 и выше, Safari 6 и выше.</p>

<h6 class="margin-bottom-standard us-margin-top">7. Обновления/новые версии Программы</h6>
<p>7.1. Действие настоящей Лицензии распространяется на все последующие обновления/новые версии Программы.
    Соглашаясь с установкой обновления/новой версии Программы, Пользователь принимает условия настоящей
    Лицензии для соответствующих обновлений/новых версий Программы, если обновление/установка новой версии
    Программы не сопровождается иным лицензионным соглашением.</p>

<h6 class="margin-bottom-standard us-margin-top">8. Изменения условий настоящей Лицензии</h6>
<p>8.1. Настоящее лицензионное соглашение может изменяться Правообладателем в одностороннем порядке.
    Уведомление Пользователя о внесении изменений в условия настоящей Лицензии осуществляется в форме
    уведомлений в кабинете пользователя. Изменения в условиях лицензионного соглашения вступают в силу
    с даты их публикации, указанной в тексте Лицензии.</p>

<h4 class="margin-bottom-standard us-margin-top">Условия использования сайта <a href="http://www.skiliks.com">www.skiliks.com</a></h4>
<p>ООО "Скиликс", ИНН 7743866434 (Скиликс) предоставляет любому лицу, использующему сайт (Пользователь)
    услуги на описанных ниже условиях. Любое использование сайта www.skiliks.com (Сайт) означает, что вы
    полностью согласны с данными условиями. </p>

<h6 class="margin-bottom-standard us-margin-top">1. Профиль на www.skiliks.com</h6>
<p>1.1 Для использования Сайта Пользователю необходимо иметь доступ в Интернет. Пользователю необходимо иметь
    оборудование (компьютер, модем и другое оборудование), необходимое для обеспечения доступа в Интернет.</p>
<p>1.2 При использовании сервисов на Сайте Пользователь соглашается предоставлять точную, актуальную и полную
    информацию и себе в соответствии с формами регистрации. Если Пользователь  предоставляет информацию, не
    соответствующую действительности, или не точную, не актуальную информацию, или Скиликс имеет основания
    подозревать, что Пользователем введена  информация, не соответствующая действительности, не точная или
    не актуальная, то Скиликс имеет право заблокировать или полностью удалить профиль такого Пользователя
    без предоставления возможности в дальнейшем пользоваться услугами Сайта.</p>
<p>1.3 После завершения процедуры регистрации на Сайте Пользователь использует введённые при регистрации
    email в качестве логина и пароль для входа на Сайт. Пользователь несёт полную ответственность за
    сохранность логина и пароля и за действия, совершённые на сайте с помощью данных логина и пароля. </p>
<p>1.4 Пользователь подтверждает, что все персональные данные, информация о компании и о позициях внутри
    компании предоставляются им от собственного имени. Это означает, что именно Пользователь, а не Скиликс,
    несёт полную ответственность за последствия своих действий или бездействия при использовании Сайта.</p>

<h6 class="margin-bottom-standard us-margin-top">2. Изменения услуг Сайта</h6>
<p>2.1 Скиликс оставляет за собой право в любое время модифицировать или прекращать временно или полностью
    услуги, предоставляемые с помощью Сайта как с уведомлением, так и без уведомления Пользователя.
    Скиликс не несёт ответственности перед Пользователем за такие модификации или прекращение услуг.</p>

<h6 class="margin-bottom-standard us-margin-top">3. Авторские права и торговые марки</h6>
<p>3.1 Содержание Сайта, включая, но не ограничиваясь, результатами оценки, текстами, изображениями,
    логотипами, интерфейсами, пиктограммами, является объектом исключительного права Скиликс на использование
    и прав других правообладателей, предоставивших Скиликс право на использование объектов прав.
    Все торговые марки являются собственностью Скиликс или других собственников, предоставивших Скиликс
    право использования данных торговых марок.  Пользователь не имеет права копировать, публиковать,
    распространять, модифицировать, продавать, доводить до всеобщего сведения, создавать производные или
    использовать авторские материалы без специального разрешения Скиликс.</p>