<div class="help-container">
    <section class="dashboard corpdashboard">

        <?php $this->renderPartial('_help_menu', ['active' => ['faq' => true]]) ?>

        <div class="nice-border border-radius-standard">

            <ul class="question-container column-full">

                <li class="action-toggle-help-paragraph">
                    Для кого предназначена симуляция?
                    <div class="color-797966">
                        <p class="">
                            Симуляцию могут использовать все, у кого есть потребность проверять наличие менеджерских навыков,
                            - руководители подразделений любого уровня, отделы HR, собственники бизнеса, рекрутинговые и HR агентства.
                        </p>

                        <p class="">
                            Симуляция может быть использована как для оценки навыков при приёме менеджера на работу,
                            так и для оценки навыков сотрудников компании.
                        </p>
                        <p class="">
                            Симуляция оценивает базовые менеджерские навыки и может быть использована для оценки всех руководящих позиций,
                            кроме высшего менеджмента.
                            Симуляция применима также для оценки специалистов, выполняющих управленческие функции частично.
                        </p>
                    </div>
                </li>

                <li class="action-toggle-help-paragraph">
                    Что необходимо для использования симуляции?
                    <div class="color-797966">
                        <p class="">
                            Чтобы получить доступ к симуляциям, необходимо зарегистрироваться
                            в качестве корпоративного пользователя. И оплатить выбранный вами тариф.
                        </p>

                        <p class="">
                            Чтобы протестировать конкретного менеджера, необходимо отправить ему
                            приглашение, для чего нужно указать его имя, фамилию и email.
                        </p>
                        <p class="">
                            После отправки приглашения менеджер получает email с активационной ссылкой,
                            регистрируется, принимает приглашение в своём личном кабинете и проходит симуляцию.
                        </p>
                        <p class="">
                            После прохождения симуляции менеджер и работодатель (корпоративный пользователь) получают доступ к результатам теста
                            (общая схема оцениваемых показателей представлена здесь: <a href="http://www.skiliks.com/static/product">http://www.skiliks.com/static/product</a>).
                        </p>
                    </div>
                </li>

                <li class="action-toggle-help-paragraph">
                    Учитываются ли в симуляции специфические требования компании к сотрудникам?
                    <div class="color-797966">
                        <p class="">
                            Специфические требования компании не учитываются. Симуляция создана под универсальные требования к менеджеру, ориентированному на результат,
                            и покрывает около 70% навыков, которые менеджер ежедневно использует в своей работе.
                        </p>
                    </div>
                </li>

                <li class="action-toggle-help-paragraph">
                    Как убедиться в том, что симуляцию проходил именно тот человек, кому отправлено приглашение?
                    <div class="color-797966">
                        <p class="">
                            В настоящее время мы предоставляем корпоративному пользователю набор из 10 конкретных ответов тестируемого. Задав те же вопросы в
                            личном интервью, работодатель имеет возможность проверить, сам тестируемый проходил симуляцию или нет.
                        </p>
                    </div>
                </li>
                <li class="action-toggle-help-paragraph">
                    Лицензионное соглашение
                    <div class="color-797966">
                        <?php $this->renderPartial('../pages/_terms')  ?>
                    </div>
                </li>
            </ul>
        </div>
    </section>
</div>
<div style="margin-top: 30px;margin-left: 30px;color: #ffffff;font-size: 16px;">
    Если вы не нашли ответа на свой вопрос, <a style="color: #287FC3" href="mailto:support@skiliks.com">свяжитесь с нами</a>
</div>

<div class="clearfix"></div>