<?php $this->renderPartial('_help_menu', ['active' => ['personal' => true]]) ?>

<ul class="question-container">
    <li class="solo ">
        Логин и пароль
        <div>
            <p class="">
                Если вы получили приглашение от работодателя, то для регистрации вам необходимо пройти по активационной
                ссылке, указанной в письме. Email, предоставленный при регистрации, является вашим идентификатором
                и логином в системе.
            </p><p class="">
                Если вы забыли свой пароль, вы можете восстановить его, воспользовавшись ссылкой
                "Забыли пароль" в меню входа на сайт.
            </p>
        </div>

    </li>
</ul>

<h2>Личный кабинет</h2>

<ul class="question-container">

    <li class="">
        Приём приглашений
        <div>
            <p class="">
                В таблице полученных приглашений вы можете видеть приглашения от компаний на прохождение симуляции.
            </p><p class="">
                Вам необходимо принять приглашение, чтобы начать прохождение симуляции и получить оценку своих навыков.
            </p><p class="">
                Вы также можете отказаться от приглашения, работодатель получит соответствующее уведомление.
                В случае отказа от приглашения, пожалуйста, укажите причину, чтобы мы могли улучшить сервис.
                Причины отказа не передаются работодателю.
            </p>
        </div>
    </li>

    <li class="">
        Прохождение симуляции
        <div>
            <p class="">
                После принятия приглашения от компании вам становится доступно прохождение полной версии симуляции,
                дающей оценку навыков. Внимательно ознакомьтесь с информацией по правилам прохождения прежде, чем
                приступить к тестированию.
            </p><p class="">
                Демо-версия симуляции доступна всегда в неограниченном количестве. Мы советуем пройти ее до того,
                как перейти к основному тестированию.
            </p>
        </div>
    </li>

    <li class="">
        Просмотр результатов тестирования
        <div>
            <p class="">
                После прохождения симуляции в столбце "Относительный рейтинг" вы видите ваш результат по отношению
                ко всем проходившим симуляцию. Кликнув на данный рейтинг, вы перейдёте к просмотру детального отчёта по
                оценке навыков. Результат последнего тестирования отображается в блоке Мои навыки, откуда также возможен
                просмотр детального отчёта о навыках.
            </p>
        </div>
    </li>
</ul>

<h2>Мой профиль</h2>

<ul class="question-container">

    <li class="">
        Личные данные
        <div>
            <p class="">
                Ваш email является идентификатором в системе, он не изменяем.
            </p><p class="">
                Ваш профессиональный статус, отрасль, дата рождения и местонахождение нужны нам для будущего сервиса сравнения.
            </p>
        </div>
    </li>

    <li class="">
        Пароль
        <div>
            <p class="">
                Возможность изменения пароля доступа к сайту.
            </p>
        </div>
    </li>
</ul>

</div>

</section>
</div>