<div class="help-container">
    <section class="dashboard corpdashboard">
        <?php $this->renderPartial('_help_menu', ['active' => ['personal' => true]]) ?>

        <div class="div-questions-container">

            <div class="nice-border border-radius-standard">
                <ul class="question-container column-full">
                    <li class="solo action-toggle-help-paragraph">
                        Логин и пароль
                        <div class="color-797966">
                            <p>Если вы получили приглашение от работодателя, то для регистрации вам необходимо пройти по активационной ссылке, указанной в письме.</p>
                            <p>Для входа на сайт используйте email и пароль, введенные вами при регистрации.</p>
                            <p>1) Если вы не можете войти на сайт, проверьте правильность введенной почты и пароль.</p>
                            <p>2) Если вы забыли пароль к своему аккаунту - воспользуйтесь возможностью восстановить пароль.
                                Нажмите "Вход" в правом верхнем углу сайта, "Забыли пароль?" и введите почту, с которой вы регистрировались.
                                вам на почту будет отправлено письмо с ссылкой восстановления пароля.</p>
                            <p>3) Если было больше 5 попыток подобрать пароль к вашему аккаунту, то доступ по прежней почте и паролю будет
                                ограничен и вам на почту придет письмо для смены пароля. Рекомендуем в данном случае сменить пароль на более сложный.</p>

                        </div>

                    </li>
                </ul>
            </div>

            <br/>

            <h2>Личный кабинет</h2>

            <br/>

            <div class="nice-border border-radius-standard">
                <ul class="question-container column-full">

                    <li class="action-toggle-help-paragraph">
                        Приём приглашений
                        <div class="color-797966">
                            <p>В таблице полученных приглашений вы можете видеть приглашения от компаний на прохождение симуляции.</p>
                            <p>Вам необходимо принять приглашение, чтобы начать прохождение симуляции и получить оценку своих навыков.</p>
                            <p>Вы также можете отказаться от приглашения, работодатель получит соответствующее уведомление.  В случае отказа от
                                приглашения, пожалуйста, укажите причину, чтобы мы могли улучшить сервис. Причины отказа не передаются работодателю.</p>

                        </div>
                    </li>

                    <li class="action-toggle-help-paragraph">
                        Требования к игре
                        <div class="color-797966">
                            <p>1)	Звук</p>
                            <p>Для полного погружения в игру и для большей эффективности вам необходимо обеспечить наличие наушников либо динамиков.</p>
                            <p>2)	Браузер</p>
                            <p>Убедитесь, что у вас установлен браузер Firefox (от 18 версии), Chrome (от 22 версии) или
                                Internet Explorer (от 10), Safari (6, 7). При необходимости установите последние стабильные версии данных браузеров.</p>
                            <p>Обратите внимание, что в других браузерах начать симуляцию вы не сможете.</p>
                            <p>3)	Интернет</p>
                            <p>Обеспечьте хорошее и стабильное (!) Интернет соединение. Симуляция не запустится при скорости менее 1Мб в секунду.
                                Отключите торрент-трекеры и другие программы, которые используют трафик Интернета.</p>
                            <p>Если в игре вы увидите сообщение о потере соединения с интернетом, то не закрывайте окно браузера и дождитесь
                                появления сообщения, что соединение восстановлено. Далее вы сможете продолжить игру.</p>
                            <p>4)	Лишние программы</p>
                            <p>Перед началом игры мы проверяем производительность вашего компьютера, поэтому на время
                                прохождением симуляции мы рекомендуем закрыть все приложения и лишние вкладки браузера,
                                в котором вы собираетесь проходить игру.</p>

                        </div>
                    </li>
                    <li class="action-toggle-help-paragraph">
                        Прохождение демо-симуляции
                        <div class="color-797966">
                            <p>Демо-версия симуляции доступна всегда в неограниченном количестве,
                                в ней не происходит оценка навыков, а только демонстрация интерфейсов и оценки (данные заполняются случайным образом!).</p>
                        </div>
                    </li>
                    <li class="action-toggle-help-paragraph">
                        Прохождение полной игры
                        <div class="color-797966">
                            <p>После принятия приглашения от компании вам становится доступно прохождение полной версии симуляции, дающей оценку навыков</p>
                            <p>1)	Прохождение симуляции занимает 2 часа. Всего с учётом подготовки и ознакомления с документами вам может потребоваться до 3 часов.</p>
                            <p>2)	Симуляцию остановить нельзя, пауз и перерывов не предусмотрено. Выберите удобное время для прохождения симуляции, чтобы вас никто
                                не отвлекал.</p>
                            <p>3)	До начала симуляции вам будет дополнительно предоставлено 30 минут для ознакомления с командой, коллегами,
                                поставленными задачами, имеющимися документами, а также интерфейсом игры.</p>
                            <p>4)	Не прибегайте к чужой помощи для прохождения симуляции. Это не поможет и не покажет ваш истинный уровень.</p>
                            <p>После завершения игры в течении 2-3 минут будет рассчитываться оценка. Позже вы будете перенаправлены в Личный кабинет,
                                где вам будет показана детальная оценка в виде инфографики. Результаты вы сможете скачать в формате .pdf по клику на «Полный отчет».</p>

                        </div>
                    </li>
                    <li class="action-toggle-help-paragraph">
                        Просмотр результатов тестирования
                        <div class="color-797966">
                            <p>Возможны 2 варианта преставления рейтинга:</p>
                            <p>1) абсолютный (скрин звезд)– по отношению к максимуму в симуляции,</p>
                            <p>2) относительный (скрин человечков) -  по отношению ко всем проходившим симуляцию.</p>
                            <p>Переключение между типами рейтингов происходит по клику на переключатель. (скрин переключателя добавить).</p>
                            <p>Кликнув на данный рейтинг, вы перейдёте к просмотру детального отчёта по оценке навыков.</p>
                            <p>Результат последнего тестирования отображается в блоке Мои навыки, откуда также возможен просмотр детального отчёта о навыках.</p>

                        </div>
                    </li>
                </ul>
            </div>

            <br/>

            <h2>Мой профиль</h2>

            <br/>

            <div class="nice-border border-radius-standard">
                <ul class="question-container column-full">

                    <li class="action-toggle-help-paragraph">
                        Личные данные
                        <div class="color-797966">
                            <p>Ваш email является идентификатором в системе, он не изменяем.</p>
                            <p>Ваш профессиональный статус, отрасль, дата рождения и местонахождение нужны нам для будущего сервиса сравнения.</p>

                        </div>
                    </li>

                    <li class="action-toggle-help-paragraph">
                        Пароль
                        <div class="color-797966">
                            <p>Возможность изменения пароля доступа к сайту.</p>
                            <p>Рекомендации к паролю:</p>
                            <p>1)Выбирайте пароль, в котором будут цифры и буквы (ЗАГЛАВНЫЕ и строчные)</p>
                            <p>2) (большие и малые)</p>
                            <p>3)Если вы в будущем не сможете войти на сайт или забудете пароль, то вы всегда сможете его восстановить.</p>

                        </div>
                    </li>
                </ul>
            </div>
        </div>
    </section>
</div>

<div class="clearfix"></div>