<?php $this->renderPartial('_help_menu', ['active' => ['corporate' => true]]) ?>

<ul class="question-container">
    <li class="solo">
        Логин и пароль
        <div>
            <p>
                Логином в системе является первоначальный email, предоставленный при регистрации. Он может не совпадать с вашим
                корпоративным email
            </p>

            <p>
                Используйте пароль, введённый при регистрации. Если вы забыли свой пароль, вы можете восстановить его,
                воспользовавшись ссылкой «Забыли пароль» в меню входа на сайт. Вы в любое время можете сменить пароль в
                своём <a href="http://skiliks.com/profile/corporate/password">профиле</a>
            </p>
        </div>

    </li>
</ul>

<h2>Рабочий кабинет</h2>

<ul class="question-container">

    <li>
        Отправка приглашений
        <div>
            <p>
                Введите имя, фамилию и email человека, которого вы хотите протестировать с помощью симуляции.
                Имя и фамилия отобразятся в тексте приглашения, которое получит адресат.
            </p>

            <p>
                Выберите вакансию/позицию, на которую вы проводите тестирование, это позволит вам сравнивать кандидатов
                и сотрудников в рамках данной позиции. Данная вакансия/позиция также будет отображена в отправляемом
                приглашении.
            </p>
            <p>
                В окне приглашения вы можете скорректировать текст письма по своему усмотрению.
            </p>
        </div>
    </li>

    <li>
        Мониторинг статуса приглашений
        <div>
            <p>
                В таблице отправленных приглашений вы можете видеть статус каждого приглашения и время,
                когда этот статус возник:
            </p>
            <br/>
            <p>
                •	Ожидание – приглашение отправлено вами, приглашённый пока не предпринял никаких действий<br/>
                •	Принято – приглашённый зарегистрировался на сайте и принял приглашение на прохождение симуляции<br/>
                •	Отклонено – приглашённый отклонил ваше приглашение на прохождение симуляции<br/>
                •	Начато – приглашённый начал прохождение симуляции<br/>
                •	Готово – симуляция пройдена, доступны результаты<br/>
                •	Просрочено – прошла неделя с момента отправки приглашения, а приглашённый не предпринял никаких действий.<br/>
            </p>
            <br/>
            <p>
                В настройках приглашения вы можете отправить приглашение заново или удалить приглашение.
            </p>
        </div>
    </li>

    <li>
        Прохождение симуляции
        <div>
            <p>
                По кнопке «Начать симуляцию» вам доступны симуляции для собственного прохождения. Ваши личные прохождения вычитаются из доступного вам количества симуляций.
            </p>
            <p>
                Демо-версия симуляции доступна всегда в неограниченном количестве, в ней не происходит оценка навыков, а только демонстрация интерфейсов.
            </p>
        </div>
    </li>

    <li>
        Просмотр результатов тестирования
        <div>
            <p>
                В столбце «Относительный рейтинг» вы видите результат тестируемого по отношению ко всем проходившим
                симуляцию. Кликнув на данный рейтинг, вы перейдёте к просмотру детального отчёта по оценке навыков.
            </p>
        </div>
    </li>

    <li>
        Продление и смена тарифного плана
        <div>

            <p>
                Вы можете продлить ваш текущий тарифный план или перейти на новый. Продление текущего тарифного плана
                возможно по истечении времени его действия. При переходе на новый тарифный план не использованные по прежнему тарифу симуляции пропадают.

            </p>
            <p>
                В настоящее время оформление всех тарифных планов кроме Lite происходит через форму связи с нами.
            </p>

        </div>
    </li>

    <li>
        Оплата
        <div>
            <p>
                Из способов оплаты на данный момент доступна только оплата по счёту. Введите ваши реквизиты при
                оформлении заказа и мы вышлем вам счёт на email, указанный при регистрации. Симуляции будут зачислены
                вам после подтверждения оплаты. Банковский перевод обычно занимает 2-3 рабочих дня, если вы хотите
                начать использовать симуляции раньше, пришлите нам на
                <a href="mailto: invoice@skiliks.com">invoice@skiliks.com</a> подтверждение проведённого
                платежа и мы решим этот вопрос.
            </p>
        </div>
    </li>
</ul>

<h2>Мой профиль</h2>

<ul class="question-container">

    <li>
        Личные данные
        <div>
            <p>
                В разделе «Мой профиль» Ваш email является идентификатором в системе, он не изменяем.
                Ваша должность нужна нам для понимания, какие услуги вам лучше предлагать.
            </p>
        </div>
    </li>

    <li>
        Пароль
        <div>
            <p>
                Возможность изменения пароля доступа к сайту.
            </p>
        </div>
    </li>

    <li>
        Информация о компании
        <div>
            <p>
                Название вашей компании используется в приглашениях, которые вы отправляете кандидатам
                на прохождение симуляции.
            </p>

            <p>
                Отрасль и размер компании нужны нам для понимания, какие услуги вам лучше предлагать,
                а также для будущего сервиса сравнения менеджеров по отраслям и размеру компании.
            </p>

            <p>
                Описание компании может использоваться в приглашениях кандидатам, данный сервис находится в разработке.
            </p>
        </div>
    </li>


    <li>
        Тариф
        <div>
            <p>
                При первоначальной регистрации активируется тарифный план Lite, по которому вы можете использовать
                10 симуляций бесплатно.
            </p>

            <p>
                Для смены или продления тарифного плана воспользуйтесь соответствующими кнопками.
            </p>
        </div>
    </li>


</ul>

</div>


</div>