<?php $this->renderPartial('_help_menu', ['active' => ['faq' => true]]) ?>

        <ul class="question-container">

            <li>
                Для кого предназначена симуляция?
                <div>
                    <p>
                        Симуляцию могут использовать все, у кого есть потребность проверять наличие менеджерских навыков, -
                        руководители подразделений любого уровня, отделы HR, собственники бизнеса, рекрутинговые и HR агентства
                    </p>

                    <p>
                        Симуляция может быть использована как для оценки навыков при приёме менеджера на работу,
                        так и для оценки навыков сотрудников компании.
                    </p>
                    <p>
                        Симуляция оценивает базовые менеджерские навыки и может быть использована для оценки всех руководящих
                        позиций, кроме высшего менеджмента. Симуляция применима также для оценки специалистов, выполняющих
                        управленческие функции частично.
                    </p>
                </div>
            </li>

            <li>
                Что необходимо для использования симуляции?
                <div>
                    <p>
                        Чтобы получить доступ к симуляциям, необходимо зарегистрироваться  в качестве корпоративного пользователя.
                        Первый месяц по тарифу Lite доступно 10 симуляций бесплатно, которые зачисляются автоматически
                        после регистрации.
                    </p>

                    <p>
                        Чтобы протестировать конкретного менеджера, необходимо отправить ему приглашение, для чего нужно указать
                        его имя, фамилию и email.
                    </p>
                    <p>
                        После отправки приглашения менеджер получает email с активационной ссылкой, регистрируется,
                        принимает приглашение в своём личном кабинете и проходит симуляцию.
                    </p>
                    <p>
                        После прохождения симуляции индивидуальный менеджер и работодатель (корпоративный пользователь) получают
                        доступ к результатам теста (общая схема оцениваемых показателей представлена
                        <a href="http://www.skiliks.com/static/product">здесь</a>).
                    </p>
                </div>
            </li>

            <li>
                Учитываются ли в симуляции специфические требования компании к сотрудникам?
                <div>
                    <p>
                        Специфические требования компании не учитываются. Симуляция создана под универсальные требования к
                        менеджеру, ориентированному на результат, и покрывает около 70% навыков, которые менеджер ежедневно
                        использует в своей работе.
                    </p>
                </div>
            </li>

            <li>
                Как убедиться в том, что симуляцию проходил именно тот человек, кому отправлено приглашение?
                <div>
                    <p>
                        В настоящее время мы предоставляем корпоративному пользователю набор из 10 конкретных ответов тестируемого.
                        Задав те же вопросы в личном интервью, работодатель имеет возможность проверить,
                        сам тестируемый проходил симуляцию или нет.
                    </p>
                </div>
            </li>
        </ul>

    </div>


</div>